package com.azkar.azkarelmuslim.doaatypespackage.presenters.presenterimpl;

import android.content.Context;
import android.util.Log;

import com.azkar.azkarelmuslim.R;
import com.azkar.azkarelmuslim.base.BaseView;
import com.azkar.azkarelmuslim.doaatypespackage.models.DoaaOneTypeModel;
import com.azkar.azkarelmuslim.doaatypespackage.models.DoaaTwoTypesModel;
import com.azkar.azkarelmuslim.doaatypespackage.models.PointerOfDoaaType;
import com.azkar.azkarelmuslim.doaatypespackage.presenters.presenter.DoaTypeTwoPresenter;
import com.azkar.azkarelmuslim.doaatypespackage.viws.interfaces.DoaaTypeTwoView;

import io.reactivex.Observable;
import io.reactivex.disposables.CompositeDisposable;
import io.reactivex.disposables.Disposable;

public class DoaTypeTwoPresenterImpl implements DoaTypeTwoPresenter {
    private DoaaTypeTwoView doaaTypeTwoView;
    private String titleDoaOne;
    private String bodyDoaOne;
    private String titleDoaTwo;
    private String bodyDoaTwo;
    private String doaaTitleType;
    private Context context;
    private CompositeDisposable compositeDisposable;

    public DoaTypeTwoPresenterImpl(Context mcontext, BaseView baseView) {
        context = mcontext;
        compositeDisposable = new CompositeDisposable();
        setView(baseView);
    }

    @Override
    public void getDoaaDataOfSpecificType(int doaaType) {

        Observable<DoaaTwoTypesModel> azkatTypeObservable = Observable.just(
                getDoaaTypeObject(doaaType)
        );
        Disposable doaaDataSubscription = azkatTypeObservable.
                subscribe(doaaTwoTypesModel -> doaaTypeTwoView.onDoaaReceivedData(doaaTwoTypesModel));
        compositeDisposable.add(doaaDataSubscription);
    }


    @Override
    public void onStop() {
        if (compositeDisposable != null && !compositeDisposable.isDisposed()) {
            compositeDisposable.dispose();
            compositeDisposable.clear();
        }

    }

    @Override
    public void onDestroy() {
        if (compositeDisposable != null && !compositeDisposable.isDisposed()) {
            compositeDisposable.dispose();
            compositeDisposable.clear();
        }
    }

    @Override
    public void setView(BaseView view) {

        doaaTypeTwoView = (DoaaTypeTwoView) view;
    }

    private DoaaTwoTypesModel getDoaaTypeObject(int doaaType) {

        if (doaaType == PointerOfDoaaType.DOAA_KHALAH) {
            titleDoaOne = "عند دخول الخلاء :";
            bodyDoaOne = "فعنْ زَيْدِ بْنِ أَرْقَمَ رضي الله عنه عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :\n" +
                    "( إِنَّ هَذِهِ الْحُشُوشَ مُحْتَضَرَةٌ ، فَإِذَا أَتَى أَحَدُكُمْ الْخَلَاءَ فَلْيَقُلْ : أَعُوذُ بِاللَّهِ مِنْ الْخُبُثِ وَالْخَبَائِثِ ) رواه أبو داود (6) وصححه الألباني في صحيح أبي داود ." + "\n" + "الحشوش : مواضع قضاء الحاجة (دورات المياه)";

            titleDoaTwo = "عند الخروج من الخلاء :";
            bodyDoaTwo = "غفرانك الحمد لله الذي اذهب عني الاذي وعافاني";
            doaaTitleType = context.getResources().getString(R.string.doaa_dkhwl_hmam_title);
        } else if (doaaType == PointerOfDoaaType.DOAA_WDOWA) {
            titleDoaOne = "قبل الوضوء :";
            bodyDoaOne = " فلم يثبت فيه إلا التسمية بلفظ : ( بسم الله ) .\n" +
                    "\n" +
                    "ودليل ذلك قول النبي صلى الله عليه وسلم : ( لا وُضُوءَ لِمَنْ لَمْ يَذْكُرْ اسْمَ اللَّهِ عَلَيْهِ )" + "\n" + "روه الترمذي (25) .";
            titleDoaTwo = "بعد الوضوء :";

            bodyDoaTwo = "عقبة بن عامر رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: \"ما منكم من أحد يتوضأ فيسبغ الوضوء ثم يقول: أشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدًا عبده ورسوله؛ إلا فتح له أبواب الجنة الثمانية يدخل من أيِّها شاء\" وفي رواية في سنن الترمذي: \"ثم يقول: أشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدًا عبده ورسوله، اللهم اجعلني من التوابين واجعلني من المتطهر";
            doaaTitleType = context.getResources().getString(R.string.doaa_wdwa_title);
        } else if (doaaType == PointerOfDoaaType.DOAA_SAFAR) {
            titleDoaOne = "قبل السفر :";
            bodyDoaOne = "الله اكبر الله اكبر الله اكبرسبحان الذى سخر لنا هذا وما كنا له مقرنين وإنا إلى ربنا لمنقلبون\n" +
                    "اللهم إنا نسألك فى سفرنا هذا البر والتقوى ومن العمل ما ترضى اللهم هون علينا سفرنا هذا واطو عنا بعده اللهم انت الصاحب فى السفر وانت الخليفة فى الاهل اللهم انى اعوذ بك من وعثاء السفر\n" +
                    "وكآبة المنظر وسوء المنقلب فى المال والأهل .";

            titleDoaTwo = "بعد السفر (الوصول) :";


            bodyDoaTwo = "لا إله إلا الله وحده لا شريك له،له الملك وله الحمد وهو على كل شئ قدير،\n" +
                    "آيبون تائبون عابدون لربنا حامدون صدق الله وعده ونصر عبده وهزم الأحزاب وحده.";
            doaaTitleType = context.getResources().getString(R.string.doaa_safr_title);

        } else if (doaaType == PointerOfDoaaType.DOAA_MNZL) {
            titleDoaOne = "عند دخول المنزل :";
            bodyDoaOne = "\"بسم الله ولجنا ،وبسم الله خرجنا ، وعلى ربنا توكلنا ، ثم ليسلم على أهله\"\n";
            titleDoaTwo = "عند الخروج من المنزل :";
            bodyDoaTwo = "\n" +
                    "\"اللهُمَ إني أعُوذُ بِكَ أن أَضلَّ أوْ أُضَلَّ أَوْ أزلَّ، أو أُزلَّ، أوْ أظلِم أوْ أُظْلَم، أوْ أَجْهَلَ أوْ يُجْهَلَ عَلَيَّ\"\n" +
                    "\"بسم الله، توكَّلْتُ على الله، لا حَوْلَ ولا قُوةَ إلا بالله \"\n";

            doaaTitleType = context.getResources().getString(R.string.doaa_dkhwl_mnzl_title);

        } else if (doaaType == PointerOfDoaaType.DOAA_FOOD) {
            titleDoaOne = "قبل تناول الطعام :";
            bodyDoaOne = "عن عَائشة رضي اللَّه عنها قالَتْ: قالَ رسولُ اللَّه صَلّى اللهُ عَلَيْهِ وسَلَّم: \"إذا أكل أَحَدُكُمْ فَليَذْكُر اسْمَ اللَّه تعالى، فإنْ نسي أَنْ يَذْكُرَ اسْمَ اللَّه تَعَالَى في أَوَّلِهِ، فَليَقُلْ: بِسْمِ اللَّه أَوَّلَهُ وَآخِرَهُ\".";
            titleDoaTwo = "بعد تناول الطعام :";
            bodyDoaTwo = "وعن أبي أُمامة رضيَ اللَّه عنهُ أنَّ النَبيَّ صَلّى اللهُ عَلَيْهِ وسَلَّم كانَ إِذا رَفَعَ مَائِدَتَهُ قال: \"الحَمْدُ للَّه حمداً كَثيراً طَيِّباً مُبَارَكاً فِيه، غَيرَ مَكْفِيٍّ وَلا مُسْتَغْنًي عَنْهُ رَبَّنَا\" رواه البخاري." + "\n" + "\n" + "وعن مُعَاذ بن أَنس رضيَ اللَّهُ عنه قَالَ: قال رسُولُ اللَّه صَلّى اللهُ عَلَيْهِ وسَلَّم: منْ أَكَلَ طَعَاماً فقال: الحَمْدُ للَّهِ الذي أَطْعَمَني هذا، وَرَزَقْنِيهِ مِنْ غيْرِ حَوْلٍ مِنِّي وَلا قُوّةٍ، غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ\" رواه أبو داود، والترمذي.";
            doaaTitleType = context.getResources().getString(R.string.doaa_t3am_title);

        } else if (doaaType == PointerOfDoaaType.DOAA_MZAKRA) {
            titleDoaOne = "حكم تخصيص دعاء معين والتزامه في وقت المذاكرة\n";
            bodyDoaOne = "فهذا الدعاء لم يرد عن الرسول صلى الله عليه وسلم، كما لا يعرف عن أحد من السلف، وكذلك تخصيصه بوقت المذاكرة والتزام ذلك واعتقاده سنة يصيره بدعة.\n" +
                    "\n" +
                    "قال الشاطبي في الاعتصام: ومنها ـ أي البدعة الإضافية ـ التزام العبادات المعينة في أوقات معينة لم يوجد لها ذلك التعيين في الشريعة.\n" +
                    "\n" +
                    "فالمشروع للمسلم أن يستعين بالله ويدعوه بما يسر الله من الدعوات الطيبة المناسبة لحاجته في كل وقت.\n" +
                    "\n" +
                    "وجاء في فتاوى اللجنة الدائمة بالسعودية ـ24ـ 185ـ فتوى رقم:21350، ما نصه: هذه الأدعية الموضوعة للمذاكرة والنجاح والمنوعة لكل حالة، تعرض للطالب أثناء المذاكرة أدعية مبتدعة، لم يرد في تخصيصها بما ذكر دليل من كتاب الله أو سنة نبيه صلى الله عليه وسلم، أما تخصيصها بما ذكر فلا يجوز، ويجب ترك العمل بها لهذا الخصوص، وعدم اعتقاد صحتها فيما ذكر، والدعاءعبادة لله، فلا يصح إلا بتوقيف، وينبغي لكل مسلم ومسلمة أن يدعو الله بأن ييسر له أموره كلها، وأن يزيده علما وفقها في الدين، وأن يلهمه الصواب، ويذكره ما نسي، ويعلمه ما جهل، ويوفقه لكل خير، ويذلل له كل صعب، دون أن يجعل لكل حالة دعاء مبتدعا يواظب عليه، وذلك أسلم له في دينه، وأحرى أن يستجيب الله لدعائه ويوفقه لكل خير، فالله ـ سبحانه وتعالى ـ وعد من دعاه بالإجابة والتوفيق للهداية والرشاد وشرط لذلك الاستجابة لما شرع الله والإيمان به سبحانه والاستقامة على دينه، كما جاء عن الله وعن رسوله صلى الله عليه وسلم، قال الله تعالى: { وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ فَلْيَسْتَجِيبُوا لِي وَلْيُؤْمِنُوا بِي لَعَلَّهُمْ يَرْشُدُونَ}.";
            titleDoaTwo = "دعاء الله تعالى عند المذاكرة والامتحان\n";
            bodyDoaTwo = "فالفهم والحفظ غير النبوة، وعليه فلا نعلم مانعا من أن يسأل إنسان ربه في أن يرزقه فهما وحفظا كفهم وحفظ النبيين .\n" +
                    "\n" +
                    "وأما سؤال الله تعالى عند المذاكرة والامتحان بالدعوات التي ذكرتها فلا مانع منه أيضا؛ لأن المذكور دعاء حسن إلا أن تخصيصه بالأوقات المذكورة لم ترد السنة به فلا يصح أن يعتقد الداعي أن ذلك مما وردت به السنة، وقد نقل عن طائفة من العلماء الحث على أدعية في أزمنة أو أحوال معينة ومن ذلك ما قاله ابن القيم في إعلام الموقعين وهو يتحدث عن المفتين: حقيق بالمفتي أن يكثر الدعاء بالحديث الصحيح ( اللهم رب جبرائيل وميكائيل وإسرافيل فاطر السموات والأرض عالم الغيب والشهادة أنت تحكم بين عبادك فيما كانوا فيه يختلفون ، اهدني لما اختلف فيه من الحق بإذنك إنك تهدي من تشاء إلى صراط مستقيم ) وكان شيخنا ــ ابن تيمية ــ كثير الدعاء بذلك ، وكان إذا أشكلت عليه المسائل يقول : يا معلم إبراهيم علمني ، ويكثر الاستعانة بذلك اقتداء بمعاذ بن جبل رضي الله عنه حيث قال لمالك بن يخامر السكسكي عند موته ، وقد رآه يبكي فقال : والله ما أبكي على دنيا كنت أصيبها منك  ، ولكن أبكي على العلم والإيمان اللذين كنت أتعلمهما منك ، فقال معاذ بن جبل رضي الله عنه : إن العلم والإيمان مكانهما من ابتغاهما وجدهما، اطلب العلم عند أربعة : عند عويمر أبي الدرداء ، وعند عبد الله بن مسعود ، وأبي موسى الأشعري ، وذكر الرابع ، فإن عجز عنه هؤلاء فسائر أهل الأرض عنه أعجز ، فعليك بمعلم إبراهيم صلوات الله عليه ، وكان بعض السلف يقول عند الإفتاء : سبحانك لا علم لنا إلا ما علمتنا إنك أنت العليم الحكيم ، وكان مكحول يقول : لا حول ولا قوة إلا بالله ، وكان مالك يقول : ما شاء الله ، لا قوة إلا بالله العلي العظيم ، وكان بعضهم يقول : رب اشرح لي صدري ويسر لي أمري واحلل عقدة من لساني يفقهوا قولي . وكان بعضهم يقول : اللهم وفقني واهدني وسددني واجمع لي بين الصواب والثواب وأعذني من الخطأ والحرمان ، وكان بعضهم يقرأ الفاتحة ، وجربنا نحن ذلك فرأيناه أقوى أسباب الإصابة ، والمعول في ذلك كله على حسن النية ، وخلوص القصد ، وصدق التوجه في الاستمداد من المعلم الأول معلم الرسل والأنبياء صلوات الله وسلامه عليهم ، فإنه لا يرد من صدق في التوجه إليه لتبليغ دينه وإرشاد عبيده ونصيحتهم والتخلص من القول عليه بلا علم ) .";
            doaaTitleType = context.getResources().getString(R.string.doaa_mzakra_title);

        } else if (doaaType == PointerOfDoaaType.DOAA_MLABS) {
            titleDoaOne = "الدعاء المسنون عند تملك ولبس الثوب\n";
            bodyDoaOne = " فمن لبس ثوبا جديدا، ينبغي له الدعاء بما هو مأثور من الأدعية في هذا المقام, ولا يقتصر على أول ثوب جديد لبسه, كما يفهم من  ظواهر الأحاديث الواردة في هذا المجال.\n" +
                    "\n" +
                    "فقد جاء في فتح الباري للحافظ ابن حجر: وجاء أيضا فيما يدعو به من لبس الثوب الجديد، أحاديث منها ما أخرجه أبو داود، والنسائي، والترمذي، وصححه من حديث أبي سعيد: كان رسول الله صلى الله عليه وسلم إذا استجد ثوبا سماه باسمه عمامة، أو قميصا، أو رداء ثم يقول: اللهم لك الحمد، أنت كسوتنيه، أسألك خيره، وخير ما صنع له، وأعوذ بك من شره، وشر ما صنع له. وأخرج الترمذي، وابن ماجه، وصححه الحاكم من حديث عمر-رفعه-: من لبس ثوبا جديدا، فقال: الحمد لله الذي كساني ما أواري به عورتي، وأتجمل به في حياتي، ثم عمد إلى الثوب الذي أخلق، فتصدق به، كان في حفظ الله، وفي كنف الله حيا، وميتا. وأخرج أحمد والترمذي وحسنه من حديث معاذ بن أنس- رفعه-: من لبس ثوبا فقال: الحمد لله الذي كساني هذا، ورزقنيه من غير حول مني، ولا قوة، غفر الله له ما تقدم من ذنبه. انتهى.\n" +
                    "\n" +
                    "وفي شرح رياض الصالحين للشيخ ابن عثيمين: فإذا من الله عليك بلباس جديد: قميص، أو سروال، أو غترة، أو مشلح أو نحوها ولبستها فقل: اللهم لك الحمد، أنت كسوتنيه. وتسميه باسمه. اللهم لك الحمد، أنت كسوتني هذا القميص، أنت كسوتني هذا السروال، أنت كسوتني هذه الغترة، أنت كسوتني هذه الطاقية، أنت كسوتني هذا المشلح، أي شيء تلبسه وهو جديد، فاحمد الله قل: اللهم لك الحمد أنت كسوتنيه، أسألك خيره، وخير ما صنع له، وأعوذ بك من شره، وشر ما صنع له. انتهى.\n" +
                    "\n" +
                    "بل إن بعض أهل العلم قال بمشروعية الدعاء عند تملك الثوب, ولو كان غير جديد.\n" +
                    "\n" +
                    "جاء في فيض القدير للمناوي: والظاهر أن ذلك يستحب لمن ابتدأ لبس غير ثوب جديد، بأن كان ملبوسا، ثم رأيت الزين العراقي قال: يستحب عند لبس الجديد وغيره، بدليل رواية ابن السني في اليوم والليلة: إذا لبس ثوبا. انتهى. \n" +
                    "والأدعية المأثورة عند ارتداء اللباس خاصة بمن تملك ثوبا جديدا \" أو مستعملا على قول \" ويكون ذلك عند ارتدائه أول مرة, وبالتالي فلا تطلب من الشخص عند ارتداء أي ثوب كان.";
            titleDoaTwo = "من أحكام التسمية عند نزع الثياب\n";
            bodyDoaTwo = "فالذي صح عن النبي صلى الله عليه وسلم هو قوله: ستر ما بين عورات بني آدم والجن إذا وضع أحدهم ثوبه أن يقول: بسم الله. رواه الطبراني في الأوسط من حديث أنس بن مالك، وحسنه المناوي وصححه الألباني.\n" +
                    "\n" +
                    "وأما الزيادة على ذلك فلم تثبت، قال المناوي في فيض القدير: ظاهره أنه لا يزيد الرحمن الرحيم. وقال المباركفوري في تحفة الأحوذي: ولا يزيد الرحمن الرحيم لأن المحل ليس محل ذكر ووقوفا مع ظاهر هذا الخبر. وقد رواه ابن السني في عمل اليوم والليلة بزيادة: الذي لا إله إلا هو. ولفظه: ستر ما بين أعين الجن وعورات بني آدم أن يقول الرجل المسلم إذا أراد أن يطرح ثيابه: بسم الله الذي لا إله إلا هو. إلا أن أئمة الحديث الذي تكلموا على الحديث لم يصححوا هذه الرواية، لأن في سندها عبد الرحيم بن زيد العمي، قال الألباني في ثنايا تخريجه لهذا الحديث: وتابعه أيضاً عبد الرحيم بن زيد العمي وهو كذاب.\n" +
                    "\n" +
                    "فلم يصح عند وضع الثياب إذاً إلا قول (بسم الله) وزيادة الرحمن الرحيم لا إله إلا الله لا شريك له لا إله إلا هو. لم تثبت على حد علمنا، وروى الترمذي وابن ماجه الحديث من مسند علي أن النبي صلى الله عليه وسلم قال: ستر ما بين أعين الجن وعورات بني آدم إذا دخل أحدهم الخلاء أن يقول بسم الله. وصححه مغلطاي والألباني وحسنه السيوطي والمناوي.\n" +
                    "\n" +
                    "ويستفاد من هذه الروايات سُنية قول (بسم الله) عند وضع الثياب عموماً، وليس عند دخول الخلاء فقط، قال علي القارئ في المرقاة: الحكم عام ثم الظرف قيد واقعي غالبي للكشف المحتاج إلى الستر بالبسملة المتقدمة، لا أنه احترازي، فإنه ينبغي أن يبسمل إذا أراد كشف العورة عند خلع الثوب أو إرادة الغسل.";
            doaaTitleType = context.getResources().getString(R.string.doaa_mlabs_title);

        } else if (doaaType == PointerOfDoaaType.DOAA_MASGD) {
            titleDoaOne = "عند الذهاب الي المسجد :";
            bodyDoaOne = "اللهم اجعل في قلبي نوراً ، وفي لساني نوراً ، واجعل في سمعي نوراً ، واجعل في بصري نوراً ، من فوقي نوراً، ومن تحتي نوراً ،وعن يميني نوراً ،وعن شمالي نوراً ، ومن أمامي نوراً ، و في خلفي نوراً ،واجعل ،و اجعل في نفسي نوراً، وأعظم لي نوراً ، وعظم نوراً ، واجعل لي نوراً ، واجعلني نوراً ،اللهم أعطني نوراً ، واجعل في عصبي نوراً ، وفي لحمي نوراً ، وفي دمي نوراً ، وفي شعري نوراً ، وفي بشري نوراً \".\n" +
                    "\"اللهم اجعل لي نوراً في قبري .. ونوراً في عظامي وزدني نوراً ، وزدني نوراً ، وزدني نوراً وهب لي نوراً على نوراً\"";

            titleDoaTwo = "فالآداب التي تتعلق بالمسجد كثيرة منها:";
            bodyDoaTwo = "دعاء الدخول: فيستحب أن يقول الداخل: \"أعوذ بالله العظيم، وبوجهه الكريم، وسلطانه القديم من الشيطان الرجيم، بسم الله، والصلاة والسلام على رسول الله، اللهم افتح لي أبواب رحمتك\" وقد تعددت الروايات بذلك عن النبي صلى الله عليه وسلم في سنن أبى داود، وابن ماجه وغيرهما. \n" +
                    "ودعاء الخروج: \"بسم الله، والصلاة والسلام على رسول الله، اللهم إني أسألك من فضلك، اللهم اعصمني من الشيطان الرجيم\" تعددت الروايات بذلك أيضا في السنن. \n" +
                    "قال الإمام النووي في كتابه الأذكار: بعد ذكر أدعية الدخول والخروج، ويقدم رجله اليمنى في الدخول، ويقدم اليسرى في الخروج.انتهى. \n" +
                    "كما أن المساجد خير البقاع وأحبها إلى الله، فلا يجوز للجنب الدخول إليها إلا مروراً من غير مكث، لقوله تعالى: (ولا جنباً إلا عابري سبيل حتى تغتسلوا) [النساء: 43].\n" +
                    "وكذلك الحائض والنفساء لا يحل لهما دخول المسجد والأصل في ذلك حديث عائشة رضي الله عنها أن النبي صلى الله عليه وسلم قال: \"فإني لا أحل المسجد لحائض ولا جنب\" رواه أبو داود. \n" +
                    "والنفساء تقاس على الحائض. أما المرور فلا بأس به إذا دعت إليه الحاجة، وأمن تنجيسها المسجد. \n" +
                    "وبالجملة فلابد من صيانة المساجد عن اللغو والباطل، قال تعالى: (في بيوت أذن الله أن ترفع ويذكر فيها اسمه) [النور: 36]. قال ابن كثير في تفسيره عن ابن عباس رضي الله عنهما ـ عند هذه الآية ـ قال: نهى الله سبحانه عن اللغو فيها، قال قتادة هي هذه المساجد، أمر الله سبحانه وتعالى ببنائها وعمارتها ورفعها وتطهيرها، وقد ثبت أن النبي صلى الله عليه وسلم قال في شأن المساجد: \"إنما هي لذكر الله عز وجل والصلاة وقراءة القرآن\" رواه مسلم. \n" +
                    "والواجب صيانة المساجد عن البيع والشراء فيها، أو إنشاد الضالة لقول النبي صلى الله عليه وسلم: \"إذا رأيتم من يبيع أو يبتاع في المسجد فقولوا: لا أربح الله تجارتك\" رواه الترمذي والحاكم. ولقوله صلى الله عليه وسلم: \"من سمع رجلاً ينشد ضالة في المسجد فليقل: لا ردها الله عليك\" رواه مسلم. ولا بأس بالأكل في المسجد أو النوم إذا احتاج المرء لذلك مع المحافظة على نظافة المسجد. هذه بعض الآداب نسأل الله التوفيق في الالتزام بها. والله أعلم. ";

            doaaTitleType = context.getResources().getString(R.string.doaa_msgd_title);

        }
        DoaaTwoTypesModel doaaTwoTypesModel = new DoaaTwoTypesModel();
        doaaTwoTypesModel.setTitleDoaOne(titleDoaOne);
        doaaTwoTypesModel.setBodyDoaOne(bodyDoaOne);
        doaaTwoTypesModel.setTitleDoaTwo(titleDoaTwo);
        doaaTwoTypesModel.setBodyDoaTwo(bodyDoaTwo);
        doaaTwoTypesModel.setDoaaTitleType(doaaTitleType);
        return doaaTwoTypesModel;
    }
}
